In [1]:
import pandas as pd

In [7]:
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']

In [8]:
duration = [2,3,6,4]

In [9]:
df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})

In [10]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

Q1. Write a code to print the data present in the second row of the dataframe, df.

In [12]:
df[2:3]

  course_name  duration
2    Big Data         6

Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?

loc gives only named indexes
iloc gives inbuild indexes

Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df
then find the output for both new_df.loc[2] and new_df.iloc[2].

In [13]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [20]:
reindex=[3,0,1,2]

In [22]:
new_df=df.reindex(reindex)

In [23]:
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [25]:
new_df.loc[[2]]

  course_name  duration
2    Big Data         6

In [26]:
new_df.iloc[[2]]

        course_name  duration
1  Machine Learning         3

In [27]:
import pandas as pd

In [28]:
import numpy as np

In [29]:
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']

In [30]:
indices = [1,2,3,4,5,6]

In [31]:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [32]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.358946  0.963223  0.592406  0.281783  0.861278  0.664283
2  0.623122  0.580574  0.861800  0.368975  0.307387  0.425143
3  0.711101  0.784928  0.803408  0.945823  0.409157  0.574628
4  0.853545  0.504902  0.183535  0.325572  0.018227  0.536999
5  0.279388  0.197637  0.613891  0.491686  0.614484  0.844870
6  0.078323  0.970600  0.138263  0.414535  0.357894  0.151678

Q4. Write a code to find the following statistical measurements for the above dataframe df1:
(i) mean of each and every column present in the dataframe.
(ii) standard deviation of column, ‘column_2’

In [36]:
a=df1.groupby("column_1")

In [34]:
a.mean()

          column_2  column_3  column_4  column_5  column_6
column_1
0.078323  0.970600  0.138263  0.414535  0.357894  0.151678
0.279388  0.197637  0.613891  0.491686  0.614484  0.844870
0.358946  0.963223  0.592406  0.281783  0.861278  0.664283
0.623122  0.580574  0.861800  0.368975  0.307387  0.425143
0.711101  0.784928  0.803408  0.945823  0.409157  0.574628
0.853545  0.504902  0.183535  0.325572  0.018227  0.536999

In [42]:
df1['column_2'].std()

np.float64(0.29929076339703475)

In [50]:
df1['column_2'][[1]]="sanjay"

C:\Users\sanja\AppData\Local\Temp\ipykernel_20012\988253239.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'sanjay' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df1['column_2'][[1]]="sanjay"

In [51]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.358946    sanjay  0.592406  0.281783  0.861278  0.664283
2  0.623122  0.580574  0.861800  0.368975  0.307387  0.425143
3  0.711101  0.784928  0.803408  0.945823  0.409157  0.574628
4  0.853545  0.504902  0.183535  0.325572  0.018227  0.536999
5  0.279388  0.197637  0.613891  0.491686  0.614484  0.844870
6  0.078323    0.9706  0.138263  0.414535  0.357894  0.151678

Q6. What do you understand about the windows function in pandas and list the types of windows
functions?

window is the subcclass of moving window

Q7. Write a code to print only the current month and year at the time of answering this question.

In [59]:
import datetime
current_date = datetime.datetime.now()
print(current_date.strftime("%B %Y"))

November 2024